cases/twoD_counterflow_flame/system/setFieldsDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "sampleConfigDict"

defaultFieldValues
(
    ignitionRegionStates
);

regions
(
    boxToCell
    {
        box (0 0 -1) ($L1 $domainLength 1);
        fieldValues
        (
            fuelInletStates
        );
    }
    boxToCell
    {
        box ($L2 0 -1) ($domainWidth $domainLength 1);
        fieldValues
        (
            airInletStates
        );
    }
);

// ************************************************************************* //
